In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('hrdata.csv')
df

     Name joining_date  salary  sick_leaves_left
0  graham     03/12/95     500                 2
1  michel     05/08/96     100                 8
2    mark     05/08/98     300                 6
3    musk     03/06/94    1000                12
4    elon     03/02/98     108                 3
5    jeff     06/12/99     100                 8

In [3]:
print(type(df['joining_date'][0]))

<class 'str'>

In [4]:
#to chnage string to date type we have one paramater in pandas that is parsedate
df=pd.read_csv('hrdata.csv',index_col='Name',parse_dates=['joining_date'])
df

       joining_date  salary  sick_leaves_left
Name
graham   1995-03-12     500                 2
michel   1996-05-08     100                 8
mark     1998-05-08     300                 6
musk     1994-03-06    1000                12
elon     1998-03-02     108                 3
jeff     1999-06-12     100                 8

In [5]:
print(type(df['joining_date'][0]))

<class 'pandas._libs.tslibs.timestamps.Timestamp'>